In [13]:
import pandas as pd
import numpy as np
import json
import ast



# Visalization
import seaborn as sns

In [2]:
credits = pd.read_csv(r'..\data\the-movies-dataset\credits.csv')
credits.head(1)

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862

In [3]:
credits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45476 entries, 0 to 45475
Data columns (total 3 columns):
cast    45476 non-null object
crew    45476 non-null object
id      45476 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.0+ MB

In [4]:
credits.isnull().any()

cast    False
crew    False
id      False
dtype: bool

In [5]:
credits = credits.set_index('id')

In [29]:
cast = pd.DataFrame(credits['cast'])
crew = pd.DataFrame(credits['crew'])

In [30]:
cast.head(1)

                                                  cast
id
862  [{'cast_id': 14, 'character': 'Woody (voice)',...

In [31]:
cast.shape

(45476, 1)

In [32]:
cast['cast'] = cast['cast'].apply(ast.literal_eval)
cast['cast_size'] = cast['cast'].apply(lambda x: len(x))
cast['cast_name'] = cast['cast'].apply(lambda x: [i['name'] for i in x] if isinstance(x, list) else [])
cast['cast_gender'] = cast['cast'].apply(lambda x: [i['gender'] for i in x] if isinstance(x, list) else [])

In [33]:
cast.head(2)

,cast,cast_size,cast_name,cast_gender
id,,,,
862,"[{'cast_id': 14, 'character': 'Woody (voice)',...",13,"[Tom Hanks, Tim Allen, Don Rickles, Jim Varney...","[2, 2, 2, 2, 2, 2, 1, 0, 2, 1, 2, 1, 2]"
8844,"[{'cast_id': 1, 'character': 'Alan Parrish', '...",26,"[Robin Williams, Jonathan Hyde, Kirsten Dunst,...","[2, 2, 1, 0, 1, 1, 2, 1, 0, 1, 2, 1, 2, 0, 0, ..."